OpenAutomationTechnologies/openSAFETY_DEMO/app/demo-sn-gpio/target/stm32f401rb/upserial.c
static BOOLEAN fTxFinished_l = FALSE;       /**< Transfer finished flag for blocking mode */
static BOOLEAN fRxFinished_l = FALSE;       /**< Receive finished flag for blocking mode */

/*----------------------------------------------------------------------------*/
/* local function prototypes                                                  */
/*----------------------------------------------------------------------------*/
static void initGpio(void);
static BOOLEAN initUsart(void);
static BOOLEAN initDma(UART_HandleTypeDef* pUsartHandler_p);
static void initNvic(void);

static BOOLEAN waitForTransferFinished(BOOLEAN * pTransFin_p, UINT32 timeoutMs_p);
static void disableFifoErrorIr(void);

/*============================================================================*/
/*            P U B L I C   F U N C T I O N S                                 */
/*============================================================================*/

/*----------------------------------------------------------------------------*/
/**
\brief  Initialize the up serial device

This function initializes the serial device connecting the uP-Master with
the uP-Slave.

\retval TRUE    On success
\retval FALSE   USART initialization failed
*/
/*----------------------------------------------------------------------------*/
BOOLEAN upserial_init(void)
{
    UINT8 fReturn = FALSE;

    if(initUsart())
    {
        initNvic();

        fReturn = TRUE;
    }

    return fReturn;
}


/*----------------------------------------------------------------------------*/
/**
\brief  Close the USART serial
*/
/*----------------------------------------------------------------------------*/
void upserial_exit(void)
{
    pfnTransfFin_l =  NULL;
    pfnReceiveFin_l = NULL;
    pfnTransfError_l = NULL;

    /* Close the USART peripherial */
    HAL_UART_DeInit(&UsartHandle_l);
}

/*----------------------------------------------------------------------------*/
/**
\brief  Register serial callback functions

\param pfnTransfFin_p     Pointer to the transfer finished callback
\param pfnReceivefFin_p   Pointer to the receive finished callback
\param pfnTransfError_p   Pointer to the transfer error callback
*/
/*----------------------------------------------------------------------------*/
void upserial_registerCb(tUpSerialTransferFin pfnTransfFin_p,
                         tUpSerialReceiveFin pfnReceivefFin_p,
                         tUpSerialTransferError pfnTransfError_p)
{
    pfnTransfFin_l = pfnTransfFin_p;
    pfnReceiveFin_l = pfnReceivefFin_p;
    pfnTransfError_l = pfnTransfError_p;
}

/*----------------------------------------------------------------------------*/
/**
\brief  Deregister serial callback functions
*/
/*----------------------------------------------------------------------------*/
void upserial_deRegisterCb(void)
{
    pfnTransfFin_l = NULL;
    pfnReceiveFin_l = NULL;
    pfnTransfError_l = NULL;
}

/*----------------------------------------------------------------------------*/
/**
\brief  Perform an USART transfer

This function starts an USART transfer to send data to the second processor.

\note This function is blocking

\param[in] pData_p       Pointer to the transmit data
\param[in] size_p        Size of the transmit data

\retval TRUE        On success
\retval FALSE       USART send failed
*/
/*----------------------------------------------------------------------------*/
BOOLEAN upserial_transmitBlock(volatile UINT8 * pData_p, UINT32 size_p)
{
    BOOLEAN fReturn = FALSE;

    if(pData_p != NULL && size_p > 0)
    {
        /* Perform a blocking UART transfer */
        if(HAL_UART_Transmit_DMA(&UsartHandle_l, (UINT8*)pData_p, size_p) == HAL_OK)
        {
            /* Wait until DMA transfer is finished */
            if(waitForTransferFinished(&fTxFinished_l, 0xFFFF))
            {
                /* Frame successfully transmitted */
                fReturn = TRUE;
            }
            else
            {
                /* Timeout occurred */
                (void)HAL_UART_DMAStop(&UsartHandle_l);
            }

            fTxFinished_l = FALSE;
        }
    }

    return fReturn;
}


/*----------------------------------------------------------------------------*/
/**
\brief  Perform an USART reception

This function blocks until the desired amount of bytes is received from the uart
serial.

\note This function is blocking

\param[in] pData_p       Pointer to the received data
\param[in] size_p        Size of the received data
\param[in] timeoutMs_p   The timeout in ms

\retval TRUE        On success
\retval FALSE       USART receive failed
*/
/*----------------------------------------------------------------------------*/
BOOLEAN upserial_receiveBlock(volatile UINT8 * pData_p, UINT32 size_p, UINT32 timeoutMs_p)
{
    BOOLEAN fReturn = FALSE;

    if(pData_p != NULL && size_p > 0)
    {
        /* Perform a blocking UART receive */
        if(HAL_UART_Receive_DMA(&UsartHandle_l, (UINT8*)pData_p, size_p) == HAL_OK)
        {
            /* Wait until DMA transfer is finished */
            if(waitForTransferFinished(&fRxFinished_l, timeoutMs_p))
            {
                /* Frame successfully received */
                fReturn = TRUE;
            }
            else
            {
                /* Timeout occurred */
                (void)HAL_UART_DMAStop(&UsartHandle_l);
            }

            fRxFinished_l = FALSE;
        }
    }

    return fReturn;
}

/*----------------------------------------------------------------------------*/
/**
\brief  Enable a DMA reception

This function enables a DMA reception via the local uP-Master <-> uP-Slave
serial device.

\param[in] pData_p       Pointer to the received data
\param[in] size_p        Size of the received data

\retval TRUE        On success
\retval FALSE       USART receive failed
*/
/*----------------------------------------------------------------------------*/
BOOLEAN upserial_enableReceive(volatile UINT8 * pData_p, UINT32 size_p)
{
    BOOLEAN fReturn = FALSE;

    if(pData_p != NULL && size_p > 0)
    {
        /* Perform a DMA transfer */
        if(HAL_UART_Receive_DMA(&UsartHandle_l, (UINT8*)pData_p, size_p) == HAL_OK)
        {
            disableFifoErrorIr();

            fReturn = TRUE;
        }
    }

    return fReturn;
}

