OpenAutomationTechnologies/openSAFETY_DEMO/app/demo-sn-gpio/target/stm32f401rb/upserial.c
/*----------------------------------------------------------------------------*/
/**
\brief  Start an USART transfer

This function starts an USART DMA transfer to send data to the second
processor.

\param[in] pData_p       Pointer to the transmit data
\param[in] size_p        Size of the transmit data

\retval TRUE        On success
\retval FALSE       USART send failed
*/
/*----------------------------------------------------------------------------*/
BOOLEAN upserial_transmit(volatile UINT8 * pData_p, UINT32 size_p)
{
    BOOLEAN fReturn = FALSE;

    if(pData_p != NULL && size_p > 0)
    {
        /* Perform a DMA transfer */
        if(HAL_UART_Transmit_DMA(&UsartHandle_l, (UINT8*)pData_p, size_p) == HAL_OK)
        {
            disableFifoErrorIr();

            fReturn = TRUE;
        }
    }

    return fReturn;
}

/*============================================================================*/
/*            P R I V A T E   F U N C T I O N S                               */
/*============================================================================*/
/** \name Private Functions */
/** \{ */

/*----------------------------------------------------------------------------*/
/**
\brief  Initialize the peripherals needed by the USART core

This function is called in the call of HAL_UART_Init and initializes all
peripherals needed to carry out the transfer with DMA.

\note
The function call __HAL_UART_ENABLE_IT() has been added for HAL 1.4.0
(STM32Cube_FW_F4_V1.4.0) support.

\param pUsartHandler_p    Pointer to the USART handler
*/
/*----------------------------------------------------------------------------*/
void HAL_UART_MspInit(UART_HandleTypeDef* pUsartHandler_p)
{
    if(pUsartHandler_p->Instance == USARTx)
    {
        USARTx_CLK_ENABLE();

        /* Initialize all needed peripherals */
        initGpio();
        initDma(pUsartHandler_p);
        __HAL_UART_ENABLE_IT(pUsartHandler_p, UART_IT_TC);
    }
}

/*----------------------------------------------------------------------------*/
/**
\brief  Close the peripherals needed by the USART core

This function is called in the call of HAL_UART_DeInit and closes all
peripherals needed by the USART core.

\param pUsartHandler_p    Pointer to the USART handler
*/
/*----------------------------------------------------------------------------*/
void HAL_UART_MspDeInit(UART_HandleTypeDef* pUsartHandler_p)
{
    if(pUsartHandler_p->Instance == USARTx)
    {
        USARTx_CLK_DISABLE();

        /* Disable the DMA Streams */
        HAL_DMA_DeInit(pUsartHandler_p->hdmarx);
        HAL_DMA_DeInit(pUsartHandler_p->hdmatx);

        /* Disable peripherals and GPIO Clocks */
        HAL_GPIO_DeInit(USARTx_GPIO_PORT, USARTx_RX_PIN);
    }
}

/*----------------------------------------------------------------------------*/
/**
\brief  Initialize the SPI GPIO pins

Enable SCK and MOSI as outputs and MISO as input.
*/
/*----------------------------------------------------------------------------*/
static void initGpio(void)
{
    GPIO_InitTypeDef GPIO_InitStruct;

    GPIO_InitStruct.Pin = USARTx_RX_PIN | USARTx_TX_PIN;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
    GPIO_InitStruct.Alternate = USARTx_ALT_FUNC;
    HAL_GPIO_Init(USARTx_GPIO_PORT, &GPIO_InitStruct);
}

/*----------------------------------------------------------------------------*/
/**
\brief  Initialize the USART core

Setup USART core for receive and transmit

\return TRUE on success; FALSE on error
*/
/*----------------------------------------------------------------------------*/
static BOOLEAN initUsart(void)
{
    BOOLEAN fReturn = FALSE;

    memset(&UsartHandle_l, 0, sizeof(UART_HandleTypeDef));

    /* Configure the USART core */
    UsartHandle_l.Instance = USARTx;
    UsartHandle_l.Init.BaudRate = 10500000;
    UsartHandle_l.Init.WordLength = UART_WORDLENGTH_8B;
    UsartHandle_l.Init.StopBits = UART_STOPBITS_1;
    UsartHandle_l.Init.Parity = UART_PARITY_NONE;
    UsartHandle_l.Init.Mode = UART_MODE_TX_RX;
    UsartHandle_l.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    UsartHandle_l.Init.OverSampling = UART_OVERSAMPLING_8;
    if(HAL_UART_Init(&UsartHandle_l) == HAL_OK)
    {
        fReturn = TRUE;
    }

    return fReturn;
}

/*----------------------------------------------------------------------------*/
/**
\brief  Initialize USART DMA for receive and transmit

Setup the DMA for receive from USART to RAM and back!

\param pUsartHandler_p    Pointer to the USART handler
*/
/*----------------------------------------------------------------------------*/
static BOOLEAN initDma(UART_HandleTypeDef* pUsartHandler_p)
{
    BOOLEAN fReturn = FALSE;

    memset(&DmaRxHandle_l, 0, sizeof(DMA_HandleTypeDef));
    memset(&DmaTxHandle_l, 0, sizeof(DMA_HandleTypeDef));

    DMAx_CLK_ENABLE();

    /* Configure DMAx - Receive channel (USART -> memory) */
    DmaRxHandle_l.Init.Channel = USARTx_RX_DMA_CHANNEL;
    DmaRxHandle_l.Init.Direction = DMA_PERIPH_TO_MEMORY;          /* P2M transfer mode                 */
    DmaRxHandle_l.Init.PeriphInc = DMA_PINC_DISABLE;              /* Peripheral increment mode Disable */
    DmaRxHandle_l.Init.MemInc = DMA_MINC_ENABLE;                  /* Memory increment mode Enable      */
    DmaRxHandle_l.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE; /* Peripheral data alignment : Byte  */
    DmaRxHandle_l.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;    /* memory data alignment : Byte      */
    DmaRxHandle_l.Init.Mode = DMA_NORMAL;                         /* Normal DMA mode                   */
    DmaRxHandle_l.Init.Priority = DMA_PRIORITY_HIGH;              /* priority level : high             */
    DmaRxHandle_l.Init.FIFOMode = DMA_FIFOMODE_DISABLE;           /* FIFO mode disabled                */
    DmaRxHandle_l.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
    DmaRxHandle_l.Init.MemBurst = DMA_MBURST_SINGLE;              /* Memory burst                      */
    DmaRxHandle_l.Init.PeriphBurst = DMA_PBURST_SINGLE;           /* Peripheral burst                  */
    DmaRxHandle_l.Instance = USARTx_RX_DMA_STREAM;
    if(HAL_DMA_Init(&DmaRxHandle_l) == HAL_OK)
    {
        __HAL_LINKDMA(pUsartHandler_p, hdmarx, DmaRxHandle_l);

        /* Configure DMAx - Transmit channel (memory -> USART) */
        DmaTxHandle_l.Init.Channel = USARTx_TX_DMA_CHANNEL;
        DmaTxHandle_l.Init.Direction = DMA_MEMORY_TO_PERIPH;          /* M2P transfer mode                 */
        DmaTxHandle_l.Init.PeriphInc = DMA_PINC_DISABLE;              /* Peripheral increment mode Disable */
        DmaTxHandle_l.Init.MemInc = DMA_MINC_ENABLE;                  /* Memory increment mode Enable      */
        DmaTxHandle_l.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE; /* Peripheral data alignment : Byte  */
        DmaTxHandle_l.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;    /* memory data alignment : Byte      */
        DmaTxHandle_l.Init.Mode = DMA_NORMAL;                         /* Normal DMA mode                   */
        DmaTxHandle_l.Init.Priority = DMA_PRIORITY_LOW;               /* priority level : low              */
        DmaTxHandle_l.Init.FIFOMode = DMA_FIFOMODE_DISABLE;           /* FIFO mode disabled                */
        DmaTxHandle_l.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
        DmaTxHandle_l.Init.MemBurst = DMA_MBURST_SINGLE;              /* Memory burst                      */
        DmaTxHandle_l.Init.PeriphBurst = DMA_PBURST_SINGLE;           /* Peripheral burst                  */
        DmaTxHandle_l.Instance = USARTx_TX_DMA_STREAM;
        if(HAL_DMA_Init(&DmaTxHandle_l) == HAL_OK)
        {
            __HAL_LINKDMA(pUsartHandler_p, hdmatx, DmaTxHandle_l);

            fReturn = TRUE;
        }
    }

    return fReturn;
}

