OpenAutomationTechnologies/openSAFETY_DEMO/app/demo-sn-gpio/target/stm32f401rb/upserial.c
/*----------------------------------------------------------------------------*/
/**
\brief  Initialize the DMA interrupts in NVIC

Setupt transfer finished and transfer error interrupts for both DMA
channels.

\note
The function calls under 'NVIC configuration for UART transfer complete
interrupt' have been added for HAL 1.4.0 (STM32Cube_FW_F4_V1.4.0) support.

*/
/*----------------------------------------------------------------------------*/
static void initNvic(void)
{
    /* NVIC configuration for DMA transfer complete interrupt (USARTx_TX) */
    HAL_NVIC_SetPriority(USARTx_DMA_TX_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(USARTx_DMA_TX_IRQn);

    /* NVIC configuration for DMA transfer complete interrupt (USARTx_RX) */
    HAL_NVIC_SetPriority(USARTx_DMA_RX_IRQn, 1, 1);
    HAL_NVIC_EnableIRQ(USARTx_DMA_RX_IRQn);

    /* NVIC configuration for UART transfer complete interrupt */
    HAL_NVIC_SetPriority(USARTx_IRQn, 1, 0);
    HAL_NVIC_EnableIRQ(USARTx_IRQn);
}

/*----------------------------------------------------------------------------*/
/**
\brief  USART transfer completed callback.

\param pUsartHandle_p     Pointer to the USART handle
*/
/*----------------------------------------------------------------------------*/
void HAL_UART_TxCpltCallback(UART_HandleTypeDef * pUsartHandle_p)
{
    if(pUsartHandle_p == &UsartHandle_l)
    {
        fTxFinished_l = TRUE;

        /* Call transfer finished callback function */
        if(pfnTransfFin_l != NULL)
            pfnTransfFin_l();
    }
}

/*----------------------------------------------------------------------------*/
/**
\brief  USART reception completed callback.

\param pUsartHandle_p     Pointer to the USART handle
*/
/*----------------------------------------------------------------------------*/
void HAL_UART_RxCpltCallback(UART_HandleTypeDef * pUsartHandle_p)
{
    if(pUsartHandle_p == &UsartHandle_l)
    {
        fRxFinished_l = TRUE;

        /* Call receive finished callback function */
        if(pfnReceiveFin_l != NULL)
            pfnReceiveFin_l();
    }
}

/*----------------------------------------------------------------------------*/
/**
\brief  DMA error callback

\param pUsartHandle_p     Pointer to the USART handle
*/
/*----------------------------------------------------------------------------*/
void HAL_UART_ErrorCallback(UART_HandleTypeDef * pUsartHandle_p)
{
    if(pUsartHandle_p == &UsartHandle_l)
    {
         /* Call transfer error callback function */
         if(pfnTransfError_l != NULL)
             pfnTransfError_l();
    }
}

/*----------------------------------------------------------------------------*/
/**
\brief  This function handles DMA Rx interrupt request
*/
/*----------------------------------------------------------------------------*/
void USARTx_DMA_RX_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(USARTx_DMA_RX_IRQn);
    HAL_DMA_IRQHandler(UsartHandle_l.hdmarx);
}

/*----------------------------------------------------------------------------*/
/**
\brief  This function handles DMA Tx interrupt request.
*/
/*----------------------------------------------------------------------------*/
void USARTx_DMA_TX_IRQHandler(void)
{
    HAL_NVIC_ClearPendingIRQ(USARTx_DMA_TX_IRQn);
    HAL_DMA_IRQHandler(UsartHandle_l.hdmatx);
}

/*----------------------------------------------------------------------------*/
/**
\brief  This function handles UART TC interrupt request.

\note
This function has been added for HAL 1.4.0 (STM32Cube_FW_F4_V1.4.0) support.

*/
/*----------------------------------------------------------------------------*/
void USARTx_IRQ_Handler(void)
{
    HAL_NVIC_ClearPendingIRQ(USARTx_IRQn);
    HAL_UART_IRQHandler(&UsartHandle_l);
}

/*----------------------------------------------------------------------------*/
/**
\brief  Wait until the transfer is finished

\param[in] pTransFin_p      Pointer to the transfer finished flag
\param[in] timeoutMs_p      Time in ms until timeout
*/
/*----------------------------------------------------------------------------*/
static BOOLEAN waitForTransferFinished(BOOLEAN * pTransFin_p, UINT32 timeoutMs_p)
{
    BOOLEAN fTransFin = FALSE;
    UINT32 currTime = HAL_GetTick();
    UINT32 timeoutTime = currTime + timeoutMs_p;

    /* Wait until timeout is reached or transfer is finished */
    while(*pTransFin_p == FALSE && currTime < timeoutTime)
    {
        currTime = HAL_GetTick();
    }

    fTransFin = *pTransFin_p;

    return fTransFin;
}

/*----------------------------------------------------------------------------*/
/**
\brief  Disable the FIFO error IR

The HAL library sometimes enables the FIFO error interrupt. As the FIFO is
disabled and not used this error has no meaning. Therefore the FE interrupt
needs to be always disabled!
*/
/*----------------------------------------------------------------------------*/
static void disableFifoErrorIr(void)
{
    /* Disable FIFO error IR */
    __HAL_DMA_DISABLE_IT(&DmaTxHandle_l, DMA_IT_FE);
    __HAL_DMA_DISABLE_IT(&DmaRxHandle_l, DMA_IT_FE);
}

/**
 * \}
 * \}
 */
